/*
 * 절차적 -> 객체지향
 * 
 * 객체지향언어 => 기존의 프로그래밍 언어에 객체지향개념(규칙)을 추가한 것
 * 
 * 장점 : 코드의 재사용성 / 유지보수 용이 / 중복코드 제거
 * 
 * 객체지향의 핵심개념 : 1.캡슐화 2.상속 3.추상화 4.다형성 (캡 상추다)
 * ====================================================================
 * 
 * 클래스 - (설계도) 객체를 정의해 놓은 것 / 객체를 생성하는데 사용 / 모든 인스턴스를 대표하는 일반적 용어
 * 객체 - (제품) 실제로 존재하는 것 / 사물 또는 개념
 * 인스턴스 - 특정 클래스로부터 생성된 객체 (Tv객체 보다는 Tv인스턴스가 더 맞는 말이다)
 * 
 * 객체 = 속성(변수) + 기능(메소드)
 */
public class 객체지향_클래스 {

	public static void main(String[] args) {
		
	}

}
